reddit_clone/app/models/user.rb

    def reset_session_token!
        self.update!(session_token: User.generate_session_token!)
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "wPy7X_2NFm0yTITttLXNCA"], ["updated_at", "2020-05-04 21:15:50.245161"], ["id", 1]]